package test_01;
/*
    百钱百鸡
    公鸡一只5元，母鸡一只3元，小鸡三只1元，用100元买了100只鸡，求公鸡母鸡小鸡各有几只。

    思路：
        1.用第一层循环表示公鸡的数量x，那么 0 <= x <= 20
        2.用第二层循环表示母鸡的数量y，那么 0 <= y <= 33
        3.小鸡的数量z就可以表示为 z = 100-x-y
        4.满足总价为100的表达式为：5x + 3y + (100-x-y)/3 == 100
          且要满足z为3的倍数：z%3 == 0
 */

public class test_05 {
    public static void main(String[] args) {

        //用for循环遍历所有可能，最后用if筛选符合要求的结果
        for(int x = 0;x<=20;x++){
            for(int y = 0;y<=33;y++){
                int z = 100-x-y;
                if(5*x + 3*y + z/3 == 100 && z%3 == 0){
                    System.out.println("公鸡"+ x +"只，"+"母鸡"+y+"只，"+"小鸡"+z+"只");
                }
            }
        }
    }
}
